; domain
(define (domain pickAndPlace)
    (:types
    ball ball robotArm robotArm room - object
  )
      
    (:requirements 
		:equality
		:existential-preconditions
	)

    (:predicates
        (robotAtRoom ?r - room)
        (ballAtRoom ?b - ball ?r - room)
        (handFree ?h - robotArm)
        (inHand ?b - ball ?h - robotArm)
    )

    (:action pickOneBall
        :parameters (?b1 - ball ?left - robotArm ?right - robotArm ?room - room)
        
        :precondition 
        (and
            (ballAtRoom ?b1 ?room)  
            (robotAtRoom ?room) 
            (handFree ?left) 
            (handFree ?right) 
            (not (inHand ?b1 ?left))
            (not (inHand ?b1 ?right))
        )
        :effect 
        (and 
			(inHand ?b1 ?left) 
			(not (ballAtRoom ?b1 ?room)) 
			(not (handFree ?left))
			(handFree ?right)  
        )
    )

    (:action pickTwoBall
        :parameters (?b1 - ball ?left - robotArm ?b2 - ball ?right - robotArm ?room - room)
        
        :precondition 
        (and 
			(not (= ?b1 ?b2))
            (ballAtRoom ?b1 ?room)
			(ballAtRoom ?b2 ?room)  
            (robotAtRoom ?room) 
            (handFree ?left)
			(handFree ?right) 
            (not (inHand ?b1 ?left))
            (not (inHand ?b2 ?right))
        )
        :effect 
        (and 
			(inHand ?b1 ?left)   
			(not (ballAtRoom ?b1 ?room))    
			(not (handFree ?left))
            (inHand ?b2 ?right)
			(not (ballAtRoom ?b2 ?room))
			(not (handFree ?right))
        )
    )
    
    (:action  placeOneBall
        :parameters (?b1 - ball  ?left - robotArm ?right - robotArm ?room - room)
        
        :precondition 
        (and 
            (not (ballAtRoom ?b1 ?room))
            (handFree ?right)
            (inHand ?b1 ?left) 
            (robotAtRoom ?room)
        )
        :effect 
        (and 
            (handFree ?right)
            (ballAtRoom ?b1 ?room)
            (handFree ?left)  
            (not (inHand ?b1 ?left))
			(not (inHand ?b1 ?right)) 
        )
    )
    
    (:action  placeTwoBall
        :parameters (?b1 - ball ?left - robotArm ?b2 - ball ?right - robotArm ?room - room)
        
        :precondition 
        (and
            (not (ballAtRoom ?b1 ?room))
			(not (= ?b1 ?b2))
			(not (ballAtRoom ?b2 ?room))
            (inHand ?b1 ?left)
            (inHand ?b2 ?right)
            (robotAtRoom ?room)
        )
        :effect 
        (and
			(ballAtRoom ?b1 ?room)
			(handFree ?left)
			(not (inHand ?b1 ?left))
			(ballAtRoom ?b2 ?room)
			(handFree ?right)
			(not (inHand ?b2 ?right))      
        )
    )
    
    (:action move 
        :parameters (?rooma - room ?roomb - room)
        :precondition (robotAtRoom ?rooma)
        :effect (and (robotAtRoom ?roomb) (not (robotAtRoom ?rooma)))
    )
    
)

; problem
(define (problem pickAndPlace_5Balls)

    (:domain pickAndPlace)
    
    (:objects
        rooma roomb - room
        ball1 ball2 ball3 ball4 ball5 - ball
        left right - robotArm
    )

    (:init  
        (robotAtRoom rooma)
        (handFree left)
        (handFree right)
        (ballAtRoom ball1 rooma)
		(ballAtRoom ball2 rooma)
		(ballAtRoom ball3 rooma) 
		(ballAtRoom ball4 rooma)
		(ballAtRoom ball5 rooma)		
    )

    (:goal 
		(and 
			(ballAtRoom ball1 roomb)
			(ballAtRoom ball2 roomb)
			(ballAtRoom ball3 roomb)
			(ballAtRoom ball4 roomb)
			(ballAtRoom ball5 roomb)
		)
    )

)

; plan
1. (picktwoball ball2 right ball1 left rooma)
   deleted: (ballatroom ball2 rooma) (handfree right) (ballatroom ball1 rooma) (handfree left)
   added: (inhand ball2 right) (inhand ball1 left)
   goals met: 0 of 5
2. (move rooma roomb)
   deleted: (robotatroom rooma)
   added: (robotatroom roomb)
   goals met: 0 of 5
3. (placetwoball ball2 right ball1 left roomb)
   deleted: (inhand ball2 right) (inhand ball1 left)
   added: (ballatroom ball2 roomb) (handfree right) (ballatroom ball1 roomb) (handfree left)
   goals met: 2 of 5
4. (move roomb rooma)
   deleted: (robotatroom roomb)
   added: (robotatroom rooma)
   goals met: 2 of 5
5. (picktwoball ball4 right ball3 left rooma)
   deleted: (ballatroom ball4 rooma) (handfree right) (ballatroom ball3 rooma) (handfree left)
   added: (inhand ball4 right) (inhand ball3 left)
   goals met: 2 of 5
6. (move rooma roomb)
   deleted: (robotatroom rooma)
   added: (robotatroom roomb)
   goals met: 2 of 5
7. (placetwoball ball4 right ball3 left roomb)
   deleted: (inhand ball4 right) (inhand ball3 left)
   added: (ballatroom ball4 roomb) (handfree right) (ballatroom ball3 roomb) (handfree left)
   goals met: 4 of 5
8. (move roomb rooma)
   deleted: (robotatroom roomb)
   added: (robotatroom rooma)
   goals met: 4 of 5
9. (pickoneball ball5 right left rooma)
   deleted: (ballatroom ball5 rooma) (handfree right)
   added: (inhand ball5 right)
   goals met: 4 of 5
10. (move rooma roomb)
   deleted: (robotatroom rooma)
   added: (robotatroom roomb)
   goals met: 4 of 5
11. (placeoneball ball5 right left roomb)
   deleted: (inhand ball5 right)
   added: (ballatroom ball5 roomb) (handfree right)
   goals met: 5 of 5
